2021.05.04.org
#+OPTIONS: ^:nil
#+OPTIONS: html-postamble:nil
#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+OPTIONS: author:nil
#+HTML_HEAD: <style type="text/css">#table-of-contents h2 { display: none } .title { display: none } .authorname { text-align: right }</style>
#+HTML_HEAD: <style type="text/css">.outline-2 {border-top: 1px solid black;}</style>
#+TITLE: OCaml Weekly News
[[https://alan.petitepomme.net/cwn/2021.04.27.html][Previous Week]] [[https://alan.petitepomme.net/cwn/index.html][Up]] [[https://alan.petitepomme.net/cwn/2021.05.11.html][Next Week]]

Hello

Here is the latest OCaml Weekly News, for the week of April 27 to May 04, 2021.

#+TOC: headlines 1


* Ocaml-solidity, a new OCaml library for Solidity
:PROPERTIES:
:CUSTOM_ID: 1
:END:
Archive: https://discuss.ocaml.org/t/ann-ocaml-solidity-a-new-ocaml-library-for-solidity/7746/2

** Continuing the thread from last week, Fabrice Le Fessant announced


I should add that the project is now available in the opam-repository, see
[[https://opam.ocaml.org/packages/solidity-parser/][solidity-parser]] and
[[https://opam.ocaml.org/packages/solidity-typechecker/][solidity-typechecker]].
      



* Release of ocaml-pandoc 0.1.0
:PROPERTIES:
:CUSTOM_ID: 2
:END:
Archive: https://discuss.ocaml.org/t/ann-release-of-ocaml-pandoc-0-1-0/7759/1

** Samuel Mimram announced


I have just released [[https://github.com/smimram/ocaml-pandoc][ocaml-pandoc]], a native OCaml library to write filters
for [[https://pandoc.org/][pandoc]], which is a markdown-to-anything converter. It has allowed me to write some simple
filters I needed (such as for including code snippets, which is not supported natively).

The support is not complete yet however, I might add more if needed (and pull-requests are of course accepted
:slight_smile:).

      



* Stdlib vs Containers vs Batteries vs Base : Core functions comparison
:PROPERTIES:
:CUSTOM_ID: 3
:END:
Archive: https://discuss.ocaml.org/t/stdlib-vs-containers-vs-batteries-vs-base-core-functions-comparison/7766/1

** Jp R announced


You want to compare the main core functions found in the OCaml Stdlib (v4.12.0), Containers (v3.3), Batteries
(v3.3.0) and Base (v0.14.1) libraries ?

Check it out !

https://github.com/Fourchaux/ocaml-stdlib-containers-batteries-base-comparisons
      

** Vladimir Keleshev then added


Someone reading this might be also interested in my (less formal) comparison between OCaml Stdlib and Base:
https://gist.github.com/keleshev/764edad011a6a7a40da11716b19ddb75
      



* Martin Jambon presentation on Semgrep, Wed April 21 @ 7pm Central
:PROPERTIES:
:CUSTOM_ID: 4
:END:
Archive: https://discuss.ocaml.org/t/martin-jambon-presentation-on-semgrep-wed-april-21-7pm-central/7709/5

** Claude Jager-Rubinson announced


The recording of Martin's talk is now available:
https://hfpug.org/2021/05/01/martin-jambon-9-languages-how-we-built-semgrep-a-polyglot-static-analysis-tool/
      

** Martin Jambon then added


Thanks Claude! The talk [[https://www.youtube.com/watch?v=H6TgK-LMA4Y&t=105s][starts at 1:45]].
      

** Ryan Slade then said


[[https://comby.dev/][Comby]] may also be of interest, it's a similar project also written in OCaml.
      



* ocaml-lsp-server 1.6.0
:PROPERTIES:
:CUSTOM_ID: 5
:END:
Archive: https://discuss.ocaml.org/t/ann-ocaml-lsp-server-1-6-0/7774/1

** Rudi Grinberg announced


On behalf of the ocaml-lsp team, I'd like to announce version 1.6.0 of ocaml-lsp-server. The highlight of this
release is the updated version of merlin which brings lots of new bug fixes.

*** 1.6.0 (04/30/2020)

**** Features

- Code action to annotate a value with its type (#397)

**** Fixes

- Fix interface/implementation switching on Windows (#427)

- Correctly parse project paths with spaces and other special characters that
  must be escaped.

- Print types with ~-short-paths~ even if the project wasn't built yet
      



* Other OCaml News
:PROPERTIES:
:CUSTOM_ID: 6
:END:
** From the ocamlcore planet blog


Here are links from many OCaml blogs aggregated at [[http://ocaml.org/community/planet/][OCaml Planet]].

- [[https://hannes.nqsb.io/Posts/EC][Cryptography updates in OCaml and MirageOS]]
      



* Old CWN
:PROPERTIES:
:UNNUMBERED: t
:END:

If you happen to miss a CWN, you can [[mailto:alan.schmitt@polytechnique.org][send me a message]] and I'll mail it to you, or go take a look at [[https://alan.petitepomme.net/cwn/][the archive]] or the [[https://alan.petitepomme.net/cwn/cwn.rss][RSS feed of the archives]].

If you also wish to receive it every week by mail, you may subscribe [[http://lists.idyll.org/listinfo/caml-news-weekly/][online]].

#+BEGIN_authorname
[[https://alan.petitepomme.net/][Alan Schmitt]]
#+END_authorname
