2021.05.04.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-05-04 Tue 10:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="https://alan.petitepomme.net/cwn/2021.04.27.html">Previous Week</a> <a href="https://alan.petitepomme.net/cwn/index.html">Up</a> <a href="https://alan.petitepomme.net/cwn/2021.05.11.html">Next Week</a>
</p>

<p>
Hello
</p>

<p>
Here is the latest OCaml Weekly News, for the week of April 27 to May 04, 2021.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#1">Ocaml-solidity, a new OCaml library for Solidity</a></li>
<li><a href="#2">Release of ocaml-pandoc 0.1.0</a></li>
<li><a href="#3">Stdlib vs Containers vs Batteries vs Base : Core functions comparison</a></li>
<li><a href="#4">Martin Jambon presentation on Semgrep, Wed April 21 @ 7pm Central</a></li>
<li><a href="#5">ocaml-lsp-server 1.6.0</a></li>
<li><a href="#6">Other OCaml News</a></li>
<li><a href="#orgd6c05df">Old CWN</a></li>
</ul>
</div>
</div>


<div id="outline-container-1" class="outline-2">
<h2 id="1">Ocaml-solidity, a new OCaml library for Solidity</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-ocaml-solidity-a-new-ocaml-library-for-solidity/7746/2">https://discuss.ocaml.org/t/ann-ocaml-solidity-a-new-ocaml-library-for-solidity/7746/2</a>
</p>
</div>

<div id="outline-container-orgc2d3836" class="outline-3">
<h3 id="orgc2d3836">Continuing the thread from last week, Fabrice Le Fessant announced</h3>
<div class="outline-text-3" id="text-orgc2d3836">
<p>
I should add that the project is now available in the opam-repository, see
<a href="https://opam.ocaml.org/packages/solidity-parser/">solidity-parser</a> and
<a href="https://opam.ocaml.org/packages/solidity-typechecker/">solidity-typechecker</a>.
</p>
</div>
</div>
</div>




<div id="outline-container-2" class="outline-2">
<h2 id="2">Release of ocaml-pandoc 0.1.0</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-release-of-ocaml-pandoc-0-1-0/7759/1">https://discuss.ocaml.org/t/ann-release-of-ocaml-pandoc-0-1-0/7759/1</a>
</p>
</div>

<div id="outline-container-orgd635d24" class="outline-3">
<h3 id="orgd635d24">Samuel Mimram announced</h3>
<div class="outline-text-3" id="text-orgd635d24">
<p>
I have just released <a href="https://github.com/smimram/ocaml-pandoc">ocaml-pandoc</a>, a native OCaml library to write filters
for <a href="https://pandoc.org/">pandoc</a>, which is a markdown-to-anything converter. It has allowed me to write some simple
filters I needed (such as for including code snippets, which is not supported natively).
</p>

<p>
The support is not complete yet however, I might add more if needed (and pull-requests are of course accepted
:slight_smile:).
</p>
</div>
</div>
</div>





<div id="outline-container-3" class="outline-2">
<h2 id="3">Stdlib vs Containers vs Batteries vs Base : Core functions comparison</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://discuss.ocaml.org/t/stdlib-vs-containers-vs-batteries-vs-base-core-functions-comparison/7766/1">https://discuss.ocaml.org/t/stdlib-vs-containers-vs-batteries-vs-base-core-functions-comparison/7766/1</a>
</p>
</div>

<div id="outline-container-org13d7a72" class="outline-3">
<h3 id="org13d7a72">Jp R announced</h3>
<div class="outline-text-3" id="text-org13d7a72">
<p>
You want to compare the main core functions found in the OCaml Stdlib (v4.12.0), Containers (v3.3), Batteries
(v3.3.0) and Base (v0.14.1) libraries ?
</p>

<p>
Check it out !
</p>

<p>
<a href="https://github.com/Fourchaux/ocaml-stdlib-containers-batteries-base-comparisons">https://github.com/Fourchaux/ocaml-stdlib-containers-batteries-base-comparisons</a>
</p>
</div>
</div>


<div id="outline-container-orgbe2d0e7" class="outline-3">
<h3 id="orgbe2d0e7">Vladimir Keleshev then added</h3>
<div class="outline-text-3" id="text-orgbe2d0e7">
<p>
Someone reading this might be also interested in my (less formal) comparison between OCaml Stdlib and Base:
<a href="https://gist.github.com/keleshev/764edad011a6a7a40da11716b19ddb75">https://gist.github.com/keleshev/764edad011a6a7a40da11716b19ddb75</a>
</p>
</div>
</div>
</div>




<div id="outline-container-4" class="outline-2">
<h2 id="4">Martin Jambon presentation on Semgrep, Wed April 21 @ 7pm Central</h2>
<div class="outline-text-2" id="text-4">
<p>
Archive: <a href="https://discuss.ocaml.org/t/martin-jambon-presentation-on-semgrep-wed-april-21-7pm-central/7709/5">https://discuss.ocaml.org/t/martin-jambon-presentation-on-semgrep-wed-april-21-7pm-central/7709/5</a>
</p>
</div>

<div id="outline-container-org0fba787" class="outline-3">
<h3 id="org0fba787">Claude Jager-Rubinson announced</h3>
<div class="outline-text-3" id="text-org0fba787">
<p>
The recording of Martin's talk is now available:
<a href="https://hfpug.org/2021/05/01/martin-jambon-9-languages-how-we-built-semgrep-a-polyglot-static-analysis-tool/">https://hfpug.org/2021/05/01/martin-jambon-9-languages-how-we-built-semgrep-a-polyglot-static-analysis-tool/</a>
</p>
</div>
</div>


<div id="outline-container-orgd7b45e6" class="outline-3">
<h3 id="orgd7b45e6">Martin Jambon then added</h3>
<div class="outline-text-3" id="text-orgd7b45e6">
<p>
Thanks Claude! The talk <a href="https://www.youtube.com/watch?v=H6TgK-LMA4Y&amp;t=105s">starts at 1:45</a>.
</p>
</div>
</div>


<div id="outline-container-org1779b2f" class="outline-3">
<h3 id="org1779b2f">Ryan Slade then said</h3>
<div class="outline-text-3" id="text-org1779b2f">
<p>
<a href="https://comby.dev/">Comby</a> may also be of interest, it's a similar project also written in OCaml.
</p>
</div>
</div>
</div>




<div id="outline-container-5" class="outline-2">
<h2 id="5">ocaml-lsp-server 1.6.0</h2>
<div class="outline-text-2" id="text-5">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-ocaml-lsp-server-1-6-0/7774/1">https://discuss.ocaml.org/t/ann-ocaml-lsp-server-1-6-0/7774/1</a>
</p>
</div>

<div id="outline-container-org51a2710" class="outline-3">
<h3 id="org51a2710">Rudi Grinberg announced</h3>
<div class="outline-text-3" id="text-org51a2710">
<p>
On behalf of the ocaml-lsp team, I'd like to announce version 1.6.0 of ocaml-lsp-server. The highlight of this
release is the updated version of merlin which brings lots of new bug fixes.
</p>
</div>

<div id="outline-container-orge66bcf7" class="outline-4">
<h4 id="orge66bcf7">1.6.0 (04/30/2020)</h4>
<div class="outline-text-4" id="text-orge66bcf7">
</div>
<div id="outline-container-org428d85c" class="outline-5">
<h5 id="org428d85c">Features</h5>
<div class="outline-text-5" id="text-org428d85c">
<ul class="org-ul">
<li>Code action to annotate a value with its type (#397)</li>
</ul>
</div>
</div>

<div id="outline-container-orgdf0c0ff" class="outline-5">
<h5 id="orgdf0c0ff">Fixes</h5>
<div class="outline-text-5" id="text-orgdf0c0ff">
<ul class="org-ul">
<li>Fix interface/implementation switching on Windows (#427)</li>

<li>Correctly parse project paths with spaces and other special characters that
must be escaped.</li>

<li>Print types with <code>-short-paths</code> even if the project wasn't built yet</li>
</ul>
</div>
</div>
</div>
</div>
</div>




<div id="outline-container-6" class="outline-2">
<h2 id="6">Other OCaml News</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orge156881" class="outline-3">
<h3 id="orge156881">From the ocamlcore planet blog</h3>
<div class="outline-text-3" id="text-orge156881">
<p>
Here are links from many OCaml blogs aggregated at <a href="http://ocaml.org/community/planet/">OCaml Planet</a>.
</p>

<ul class="org-ul">
<li><a href="https://hannes.nqsb.io/Posts/EC">Cryptography updates in OCaml and MirageOS</a></li>
</ul>
</div>
</div>
</div>




<div id="outline-container-orgd6c05df" class="outline-2">
<h2 id="orgd6c05df">Old CWN</h2>
<div class="outline-text-2" id="text-orgd6c05df">
<p>
If you happen to miss a CWN, you can <a href="mailto:alan.schmitt@polytechnique.org">send me a message</a> and I'll mail it to you, or go take a look at <a href="https://alan.petitepomme.net/cwn/">the archive</a> or the <a href="https://alan.petitepomme.net/cwn/cwn.rss">RSS feed of the archives</a>.
</p>

<p>
If you also wish to receive it every week by mail, you may subscribe <a href="http://lists.idyll.org/listinfo/caml-news-weekly/">online</a>.
</p>

<div class="authorname" id="org840c800">
<p>
<a href="https://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>
