2021.05.04.txt
			  ━━━━━━━━━━━━━━━━━━━
			   OCAML WEEKLY NEWS
			  ━━━━━━━━━━━━━━━━━━━


[Previous Week] [Up] [Next Week]

Hello

Here is the latest OCaml Weekly News, for the week of April 27 to May
04, 2021.

Table of Contents
─────────────────

Ocaml-solidity, a new OCaml library for Solidity
Release of ocaml-pandoc 0.1.0
Stdlib vs Containers vs Batteries vs Base : Core functions comparison
Martin Jambon presentation on Semgrep, Wed April 21 @ 7pm Central
ocaml-lsp-server 1.6.0
Other OCaml News
Old CWN


[Previous Week] <https://alan.petitepomme.net/cwn/2021.04.27.html>

[Up] <https://alan.petitepomme.net/cwn/index.html>

[Next Week] <https://alan.petitepomme.net/cwn/2021.05.11.html>


Ocaml-solidity, a new OCaml library for Solidity
════════════════════════════════════════════════

  Archive:
  <https://discuss.ocaml.org/t/ann-ocaml-solidity-a-new-ocaml-library-for-solidity/7746/2>


Continuing the thread from last week, Fabrice Le Fessant announced
──────────────────────────────────────────────────────────────────

  I should add that the project is now available in the opam-repository,
  see [solidity-parser] and [solidity-typechecker].


[solidity-parser] <https://opam.ocaml.org/packages/solidity-parser/>

[solidity-typechecker]
<https://opam.ocaml.org/packages/solidity-typechecker/>


Release of ocaml-pandoc 0.1.0
═════════════════════════════

  Archive:
  <https://discuss.ocaml.org/t/ann-release-of-ocaml-pandoc-0-1-0/7759/1>


Samuel Mimram announced
───────────────────────

  I have just released [ocaml-pandoc], a native OCaml library to write
  filters for [pandoc], which is a markdown-to-anything converter. It
  has allowed me to write some simple filters I needed (such as for
  including code snippets, which is not supported natively).

  The support is not complete yet however, I might add more if needed
  (and pull-requests are of course accepted :slight_smile:).


[ocaml-pandoc] <https://github.com/smimram/ocaml-pandoc>

[pandoc] <https://pandoc.org/>


Stdlib vs Containers vs Batteries vs Base : Core functions comparison
═════════════════════════════════════════════════════════════════════

  Archive:
  <https://discuss.ocaml.org/t/stdlib-vs-containers-vs-batteries-vs-base-core-functions-comparison/7766/1>


Jp R announced
──────────────

  You want to compare the main core functions found in the OCaml Stdlib
  (v4.12.0), Containers (v3.3), Batteries (v3.3.0) and Base (v0.14.1)
  libraries ?

  Check it out !

  <https://github.com/Fourchaux/ocaml-stdlib-containers-batteries-base-comparisons>


Vladimir Keleshev then added
────────────────────────────

  Someone reading this might be also interested in my (less formal)
  comparison between OCaml Stdlib and Base:
  <https://gist.github.com/keleshev/764edad011a6a7a40da11716b19ddb75>


Martin Jambon presentation on Semgrep, Wed April 21 @ 7pm Central
═════════════════════════════════════════════════════════════════

  Archive:
  <https://discuss.ocaml.org/t/martin-jambon-presentation-on-semgrep-wed-april-21-7pm-central/7709/5>


Claude Jager-Rubinson announced
───────────────────────────────

  The recording of Martin's talk is now available:
  <https://hfpug.org/2021/05/01/martin-jambon-9-languages-how-we-built-semgrep-a-polyglot-static-analysis-tool/>


Martin Jambon then added
────────────────────────

  Thanks Claude! The talk [starts at 1:45].


[starts at 1:45] <https://www.youtube.com/watch?v=H6TgK-LMA4Y&t=105s>


Ryan Slade then said
────────────────────

  [Comby] may also be of interest, it's a similar project also written
  in OCaml.


[Comby] <https://comby.dev/>


ocaml-lsp-server 1.6.0
══════════════════════

  Archive:
  <https://discuss.ocaml.org/t/ann-ocaml-lsp-server-1-6-0/7774/1>


Rudi Grinberg announced
───────────────────────

  On behalf of the ocaml-lsp team, I'd like to announce version 1.6.0 of
  ocaml-lsp-server. The highlight of this release is the updated version
  of merlin which brings lots of new bug fixes.


1.6.0 (04/30/2020)
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

Features
┄┄┄┄┄┄┄┄

  • Code action to annotate a value with its type (#397)


Fixes
┄┄┄┄┄

  • Fix interface/implementation switching on Windows (#427)

  • Correctly parse project paths with spaces and other special
    characters that must be escaped.

  • Print types with `-short-paths' even if the project wasn't built yet


Other OCaml News
════════════════

From the ocamlcore planet blog
──────────────────────────────

  Here are links from many OCaml blogs aggregated at [OCaml Planet].

  • [Cryptography updates in OCaml and MirageOS]


[OCaml Planet] <http://ocaml.org/community/planet/>

[Cryptography updates in OCaml and MirageOS]
<https://hannes.nqsb.io/Posts/EC>


Old CWN
═══════

  If you happen to miss a CWN, you can [send me a message] and I'll mail
  it to you, or go take a look at [the archive] or the [RSS feed of the
  archives].

  If you also wish to receive it every week by mail, you may subscribe
  [online].

  [Alan Schmitt]


[send me a message] <mailto:alan.schmitt@polytechnique.org>

[the archive] <https://alan.petitepomme.net/cwn/>

[RSS feed of the archives] <https://alan.petitepomme.net/cwn/cwn.rss>

[online] <http://lists.idyll.org/listinfo/caml-news-weekly/>

[Alan Schmitt] <https://alan.petitepomme.net/>
